----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 512, 512]           1,792
              ReLU-2         [-1, 64, 512, 512]               0
            Conv2d-3         [-1, 64, 512, 512]          36,928
              ReLU-4         [-1, 64, 512, 512]               0
         MaxPool2d-5         [-1, 64, 256, 256]               0
            Conv2d-6        [-1, 128, 256, 256]          73,856
              ReLU-7        [-1, 128, 256, 256]               0
            Conv2d-8        [-1, 128, 256, 256]         147,584
              ReLU-9        [-1, 128, 256, 256]               0
        MaxPool2d-10        [-1, 128, 128, 128]               0
           Conv2d-11        [-1, 256, 128, 128]         295,168
             ReLU-12        [-1, 256, 128, 128]               0
           Conv2d-13        [-1, 256, 128, 128]         590,080
             ReLU-14        [-1, 256, 128, 128]               0
           Conv2d-15        [-1, 256, 128, 128]         590,080
             ReLU-16        [-1, 256, 128, 128]               0
        MaxPool2d-17          [-1, 256, 64, 64]               0
           Conv2d-18          [-1, 512, 64, 64]       1,180,160
             ReLU-19          [-1, 512, 64, 64]               0
           Conv2d-20          [-1, 512, 64, 64]       2,359,808
             ReLU-21          [-1, 512, 64, 64]               0
           Conv2d-22          [-1, 512, 64, 64]       2,359,808
             ReLU-23          [-1, 512, 64, 64]               0
        MaxPool2d-24          [-1, 512, 32, 32]               0
           Conv2d-25          [-1, 512, 32, 32]       2,359,808
             ReLU-26          [-1, 512, 32, 32]               0
           Conv2d-27          [-1, 512, 32, 32]       2,359,808
             ReLU-28          [-1, 512, 32, 32]               0
           Conv2d-29          [-1, 512, 32, 32]       2,359,808
             ReLU-30          [-1, 512, 32, 32]               0
UpsamplingBilinear2d-31          [-1, 512, 64, 64]               0
           Conv2d-32          [-1, 512, 64, 64]       4,719,104
           Conv2d-33          [-1, 512, 64, 64]       2,359,808
           unetUp-34          [-1, 512, 64, 64]               0
UpsamplingBilinear2d-35        [-1, 512, 128, 128]               0
           Conv2d-36        [-1, 256, 128, 128]       1,769,728
           Conv2d-37        [-1, 256, 128, 128]         590,080
           unetUp-38        [-1, 256, 128, 128]               0
UpsamplingBilinear2d-39        [-1, 256, 256, 256]               0
           Conv2d-40        [-1, 128, 256, 256]         442,496
           Conv2d-41        [-1, 128, 256, 256]         147,584
           unetUp-42        [-1, 128, 256, 256]               0
UpsamplingBilinear2d-43        [-1, 128, 512, 512]               0
           Conv2d-44         [-1, 64, 512, 512]         110,656
           Conv2d-45         [-1, 64, 512, 512]          36,928
           unetUp-46         [-1, 64, 512, 512]               0
           Conv2d-47         [-1, 21, 512, 512]           1,365
================================================================
Total params: 24,892,437
Trainable params: 24,892,437
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 3.00
Forward/backward pass size (MB): 2366.00
Params size (MB): 94.96
Estimated Total Size (MB): 2463.96
----------------------------------------------------------------

